// ITMO.CPP.P10.C1_aggregation.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>
#include "triangle.h"
#include "dot.h"

using namespace std;

int main()
{
	int side1;
	int side2;
	int side3;

	Dot a(1, 10), b(2, 20), c(30, 3);

	Triangle* tr = new Triangle(&a, &b, &c);
	double Area = tr->getSquare();
	cout << "Square = " << Area << endl;
	tie(side1, side2, side3) = tr->getSides();
	cout << "Sides: " << side1 << " : " << side2 << " : " << side3 << endl;
	cout << "Perimetr = " << tr->getPerimetr() << endl;
	cout << "Square = " << tr->getSquare() << endl;
	system("pause");
	return 0;
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
